import React from "react";
import {Card} from 'react-bootstrap';
import FormComponents from "./FormComponents";

import '../../Assets/styles/instructions/InstructionsCard.css';

export default function InstructionsCard() {
    return (
        <div>
        <Card className="inst-lines">
        <Card.Body>
        <Card.Text dir='rtl'>
       شرکت کننده گرامی، ضمن تشکر از همکاری شما، روند تست پیش رو مطابق زیر می‌باشد. خواهشمند است پس از مطالعه دقیق، با انتخاب گزینه "قوانین را مطالعه کرده‌ام" و سپس فشردن دکمه "شرکت در تست"، تست را شروع نمایید. <br/><br/>

        ۱- در این تست یک فایل صوتی برای شما پخش خواهد شد که پس از فشردن دکمه پخش قابلیت توقف و بازگشت به عقب را نخواهد داشت، پس قبل از شروع تست تلاش کنید در محیطی با کمترین میزان مزاحمت بیرونی قرار بگیرید.<br/><br/>

        ۲- پس از پخش فایل صوتی به صفحه‌ی دیگری هدایت می‌شوید که در آنجا می‌بایست با فشردن دکمه ضبط هر آنچه از فایل صوتی پخش شده به خاطر دارید را بازگو نمایید که این بخش نیز مانند بخش قبل قابلیت توقف نخواهد داشت.<br/><br/>

        ۳- در صورت بروز هرگونه مشکل حین انجام تست، چنانچه تمایل به شرکت مجدد دارید، از بخش تماس با ما اقدام نمایید تا مجددا به شما برای شرکت در تست دسترسی داده شود.<br/>
        </Card.Text>
        </Card.Body>
        </Card>

        <FormComponents />
        </div>
    );
}